-- MySQL dump 10.13  Distrib 8.0.27, for Linux (x86_64)
--
-- Host: localhost    Database: school
-- ------------------------------------------------------
-- Server version	8.0.27-0ubuntu0.20.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `student`
--

CREATE DATABASE IF NOT EXISTS school;
USE school;

DROP TABLE IF EXISTS `student`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student` (
  `no` char(20) NOT NULL,
  `name` char(20) NOT NULL,
  `grade` char(20) NOT NULL,
  `phone` char(20) NOT NULL,
  `province` char(20) NOT NULL,
  `major` char(20) NOT NULL,
  `age` char(20) NOT NULL,
  PRIMARY KEY (`no`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student`
--

LOCK TABLES `student` WRITE;
/*!40000 ALTER TABLE `student` DISABLE KEYS */;
INSERT INTO `student` VALUES ('001','张三','大二','110','湘','软件工程','19'),('002','李四','大一','119','京','网络工程','18'),('1','李花','大三','18712276158','粤','软件工程','19'),('10','云二','大三','14496979426','沪','计算机','19'),('11','汪八','大二','14043847277','京','软件工程','19'),('12','云七','大三','17749742695','粤','软件工程','19'),('13','张霞','大二','14889725471','京','计算机','19'),('14','云七','大二','14489788385','湘','软件工程','19'),('15','李九','大一','17540959318','京','软件工程','18'),('16','张霞','大一','18111835810','京','软件工程','19'),('17','谢霞','大四','18626580523','京','软件工程','20'),('18','杨球','大二','13280886850','沪','计算机','18'),('19','云十','大一','17589932954','粤','计算机','19'),('2','张六','大四','16563603385','湘','软件工程','21'),('20','云二','大三','18718940254','京','计算机科学与技术','19'),('21','杨四','大二','15914387719','京','计算机科学与技术','20'),('22','杨霞','大四','16933375305','粤','软件工程','19'),('23','张霞','大四','13093367505','粤','软件工程','18'),('24','杨十','大二','16358832121','京','计算机','21'),('25','汪五','大一','16113372296','粤','软件工程','21'),('26','李四','大四','18283258806','湘','软件工程','20'),('27','孔八','大三','18541880313','沪','计算机科学与技术','20'),('28','杨花','大一','17538760041','沪','计算机','21'),('29','汪十','大一','15934312078','湘','计算机科学与技术','21'),('3','谢九','大三','18696099300','粤','计算机科学与技术','20'),('30','李花','大三','18952344734','沪','计算机','19'),('31','孔十','大三','18899650579','沪','软件工程','18'),('32','汪九','大一','17948571830','沪','计算机科学与技术','19'),('33','汪一','大一','13919876702','沪','软件工程','19'),('34','汪二','大四','14851240796','粤','计算机','20'),('35','汪三','大一','15963456805','粤','软件工程','19'),('36','谢霞','大四','14079115939','沪','计算机','21'),('37','汪三','大一','14081568399','沪','软件工程','20'),('38','谢十','大二','14492703297','湘','计算机','21'),('39','张八','大三','16252202081','粤','计算机科学与技术','18'),('4','杨霞','大四','18671336898','京','计算机','20'),('40','杨三','大一','15786512845','粤','软件工程','18'),('41','云三','大四','17334142465','湘','软件工程','18'),('42','张霞','大三','18397726935','京','软件工程','19'),('43','李八','大三','18206495473','湘','软件工程','21'),('44','张球','大一','15449945040','粤','软件工程','21'),('45','云花','大四','17885968659','粤','软件工程','18'),('46','谢八','大三','13073803738','湘','软件工程','20'),('47','张一','大二','18479567969','京','计算机科学与技术','20'),('48','孔八','大四','14396144930','京','计算机','19'),('49','王二','大三','14230727238','湘','计算机','19'),('5','张七','大三','17685965875','粤','计算机','21'),('50','王九','大三','16139153659','沪','计算机科学与技术','18'),('51','孔一','大一','17050249958','湘','计算机科学与技术','19'),('52','云三','大二','18306092734','湘','计算机','19'),('53','李球','大一','15490202843','京','软件工程','19'),('54','孔六','大三','17987447696','粤','软件工程','18'),('55','孔四','大一','18417613574','粤','软件工程','19'),('56','王霞','大二','15656101256','湘','计算机','21'),('57','杨八','大四','18228667899','沪','软件工程','20'),('58','云十','大四','13472138370','京','软件工程','21'),('59','李球','大四','13496928001','湘','软件工程','18'),('6','谢球','大一','16496021517','粤','计算机','19'),('60','云九','大四','18209823704','粤','软件工程','19'),('61','汪球','大三','18188026484','京','软件工程','21'),('62','云球','大二','17695699234','京','计算机','21'),('63','李一','大一','13297613333','湘','软件工程','19'),('64','杨十','大四','14571569056','湘','软件工程','18'),('65','王石','大三','15521791962','粤','计算机','21'),('66','张一','大三','18163040201','粤','计算机科学与技术','21'),('67','汪二','大一','17637661210','沪','软件工程','18'),('68','李霞','大四','13147803869','京','计算机科学与技术','19'),('69','张霞','大三','14377309942','京','软件工程','18'),('7','汪九','大一','17436784379','湘','软件工程','20'),('70','孔六','大二','16382327046','京','软件工程','21'),('71','杨一','大三','17854713342','京','计算机','18'),('72','汪二','大二','14611197840','沪','软件工程','18'),('73','孔球','大四','16494066897','湘','计算机','21'),('74','王一','大四','14712132336','湘','计算机科学与技术','18'),('75','孔四','大四','14704158846','粤','软件工程','18'),('76','张九','大一','15690580628','沪','计算机科学与技术','20'),('77','张九','大三','17442977747','沪','计算机科学与技术','20'),('78','李三','大一','18590386177','粤','软件工程','20'),('79','张八','大二','14991119306','京','计算机','18'),('8','杨四','大一','15222171486','湘','软件工程','21'),('80','孔二','大二','16306729747','沪','软件工程','21'),('81','王石','大一','17662121545','沪','计算机科学与技术','18'),('82','云花','大三','17041045747','沪','软件工程','19'),('83','汪花','大一','16272178240','京','计算机','19'),('84','杨二','大二','14617513815','沪','计算机科学与技术','18'),('85','杨霞','大三','18471061289','湘','计算机','18'),('86','谢一','大一','13793013419','粤','计算机','18'),('87','李十','大二','15187766877','沪','计算机科学与技术','19'),('88','李五','大四','16351865758','沪','计算机','18'),('89','张二','大一','18168244040','湘','计算机','18'),('9','张花','大二','14516981040','京','软件工程','18'),('90','汪四','大四','13515063281','粤','计算机','18'),('91','杨十','大二','14789918340','粤','计算机','18'),('92','李球','大二','18425662116','粤','软件工程','19'),('93','谢六','大二','14852423274','粤','软件工程','19'),('94','汪四','大一','14654900727','沪','计算机科学与技术','19'),('95','王霞','大一','18504103911','粤','软件工程','20'),('96','杨一','大一','16214723823','京','软件工程','19'),('97','王霞','大二','13493282734','粤','软件工程','19'),('98','云九','大三','14697062513','湘','软件工程','19'),('99','王三','大四','17075448041','沪','软件工程','21');
/*!40000 ALTER TABLE `student` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-12-25 14:33:04
